historic/perfv1/buffered/m2.x4large_piops143_300/randread-09-4m.fio.out
randread-4m: (g=0): rw=randread, bs=4M-4M/4M-4M/4M-4M, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 1 process

randread-4m: (groupid=0, jobs=1): err= 0: pid=26094: Sat Mar 15 04:25:48 2014
  read : io=1352.0MB, bw=23066KB/s, iops=5, runt= 60022msec
    slat (msec): min=8, max=218, avg=177.04, stdev=17.35
    clat (usec): min=7, max=1765.3K, avg=1554640.17, stdev=229168.67
     lat (msec): min=180, max=1953, avg=1731.68, stdev=229.75
    clat percentiles (msec):
     |  1.00th=[  204],  5.00th=[ 1418], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1598],
     | 70.00th=[ 1598], 80.00th=[ 1614], 90.00th=[ 1696], 95.00th=[ 1729],
     | 99.00th=[ 1745], 99.50th=[ 1745], 99.90th=[ 1762], 99.95th=[ 1762],
     | 99.99th=[ 1762]
    bw (KB  /s): min= 2117, max=24236, per=98.45%, avg=22706.68, stdev=2933.74
    lat (usec) : 10=0.59%
    lat (msec) : 250=0.59%, 500=0.59%, 750=0.89%, 1000=0.89%, 2000=96.45%
  cpu          : usr=0.02%, sys=2.22%, ctx=18431, majf=0, minf=10267
  IO depths    : 1=0.6%, 2=1.2%, 4=2.4%, 8=95.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.4%, 8=0.0%, 16=0.6%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=338/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1352.0MB, aggrb=23065KB/s, minb=23065KB/s, maxb=23065KB/s, mint=60022msec, maxt=60022msec

Disk stats (read/write):
  xvdf: ios=31695/0, merge=0/0, ticks=2804973/0, in_queue=2807888, util=99.34%